Repository: bianchettihugo/flutter_clean_architecture
Catalog: lib/core/l10n/app_*.arb
Languages: pt_br

source: Enable Geolocation
pt_br: Habilitar Geolocalização

# enableGeolocationMsg
source: We need your location to fetch weather information
pt_br: Precisamos da sua localização para coletar informações do clima

# enableGeolocationBtn
source: Check permissions
pt_br: Checar permissões

source: Geolocation error
pt_br: Erro de geolocalização

# geolocationErrorMsg
source: Something went wrong while collecting location information. Please, try again
pt_br: Algo deu errado ao coletar informações de localização. Por favor, tente novamente

# geolocationErrorBtn
source: Try again
pt_br: Tentar novamente

source: Network error
pt_br: Erro de conexão

# networkErrorMsg
source: Unable to connect to the internet. Please, check your connection and try again
pt_br: Não foi possível conectar-se à internet. Por favor, verifique sua conexão e tente novamente

# networkErrorBtn
source: Try again
pt_br: Tentar novamente

# weatherError
source: Something went wrong
pt_br: Algo deu errado

# weatherErrorMsg
source: Unable to fetch the weather. Please, try again
pt_br: Não foi possível obter o clima. Por favor, tente novamente

# weatherErrorBtn
source: Try again
pt_br: Tentar novamente
